layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  transform_param {
    scale: 0.0170000009239
    mean_value: 103.940002441
    mean_value: 116.779998779
    mean_value: 123.680000305
  }
  data_param {
    source: "data/101_val_lmdb"
    batch_size: 10
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "scale1"
  type: "Scale"
  bottom: "conv1"
  top: "scale1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "scale1"
  top: "scale1"
}
layer {
  name: "dw_conv2_1"
  type: "Convolution"
  bottom: "scale1"
  top: "dw_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn2_1"
  type: "BatchNorm"
  bottom: "dw_conv2_1"
  top: "dw_conv2_1"
}
layer {
  name: "dw_scale2_1"
  type: "Scale"
  bottom: "dw_conv2_1"
  top: "dw_scale2_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu2_1"
  type: "ReLU"
  bottom: "dw_scale2_1"
  top: "dw_scale2_1"
}
layer {
  name: "sep_conv2_1"
  type: "Convolution"
  bottom: "dw_scale2_1"
  top: "sep_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn2_1"
  type: "BatchNorm"
  bottom: "sep_conv2_1"
  top: "sep_conv2_1"
}
layer {
  name: "sep_scale2_1"
  type: "Scale"
  bottom: "sep_conv2_1"
  top: "sep_scale2_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu2_1"
  type: "ReLU"
  bottom: "sep_scale2_1"
  top: "sep_scale2_1"
}
layer {
  name: "dw_conv2_2"
  type: "Convolution"
  bottom: "sep_scale2_1"
  top: "dw_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn2_2"
  type: "BatchNorm"
  bottom: "dw_conv2_2"
  top: "dw_conv2_2"
}
layer {
  name: "dw_scale2_2"
  type: "Scale"
  bottom: "dw_conv2_2"
  top: "dw_scale2_2"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu2_2"
  type: "ReLU"
  bottom: "dw_scale2_2"
  top: "dw_scale2_2"
}
layer {
  name: "sep_conv2_2"
  type: "Convolution"
  bottom: "dw_scale2_2"
  top: "sep_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn2_2"
  type: "BatchNorm"
  bottom: "sep_conv2_2"
  top: "sep_conv2_2"
}
layer {
  name: "sep_scale2_2"
  type: "Scale"
  bottom: "sep_conv2_2"
  top: "sep_scale2_2"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu2_2"
  type: "ReLU"
  bottom: "sep_scale2_2"
  top: "sep_scale2_2"
}
layer {
  name: "dw_conv3_1"
  type: "Convolution"
  bottom: "sep_scale2_2"
  top: "dw_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn3_1"
  type: "BatchNorm"
  bottom: "dw_conv3_1"
  top: "dw_conv3_1"
}
layer {
  name: "dw_scale3_1"
  type: "Scale"
  bottom: "dw_conv3_1"
  top: "dw_scale3_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu3_1"
  type: "ReLU"
  bottom: "dw_scale3_1"
  top: "dw_scale3_1"
}
layer {
  name: "sep_conv3_1"
  type: "Convolution"
  bottom: "dw_scale3_1"
  top: "sep_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn3_1"
  type: "BatchNorm"
  bottom: "sep_conv3_1"
  top: "sep_conv3_1"
}
layer {
  name: "sep_scale3_1"
  type: "Scale"
  bottom: "sep_conv3_1"
  top: "sep_scale3_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu3_1"
  type: "ReLU"
  bottom: "sep_scale3_1"
  top: "sep_scale3_1"
}
layer {
  name: "dw_conv3_2"
  type: "Convolution"
  bottom: "sep_scale3_1"
  top: "dw_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn3_2"
  type: "BatchNorm"
  bottom: "dw_conv3_2"
  top: "dw_conv3_2"
}
layer {
  name: "dw_scale3_2"
  type: "Scale"
  bottom: "dw_conv3_2"
  top: "dw_scale3_2"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu3_2"
  type: "ReLU"
  bottom: "dw_scale3_2"
  top: "dw_scale3_2"
}
layer {
  name: "sep_conv3_2"
  type: "Convolution"
  bottom: "dw_scale3_2"
  top: "sep_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn3_2"
  type: "BatchNorm"
  bottom: "sep_conv3_2"
  top: "sep_conv3_2"
}
layer {
  name: "sep_scale3_2"
  type: "Scale"
  bottom: "sep_conv3_2"
  top: "sep_scale3_2"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu3_2"
  type: "ReLU"
  bottom: "sep_scale3_2"
  top: "sep_scale3_2"
}
layer {
  name: "dw_conv4_1"
  type: "Convolution"
  bottom: "sep_scale3_2"
  top: "dw_conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn4_1"
  type: "BatchNorm"
  bottom: "dw_conv4_1"
  top: "dw_conv4_1"
}
layer {
  name: "dw_scale4_1"
  type: "Scale"
  bottom: "dw_conv4_1"
  top: "dw_scale4_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu4_1"
  type: "ReLU"
  bottom: "dw_scale4_1"
  top: "dw_scale4_1"
}
layer {
  name: "sep_conv4_1"
  type: "Convolution"
  bottom: "dw_scale4_1"
  top: "sep_conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn4_1"
  type: "BatchNorm"
  bottom: "sep_conv4_1"
  top: "sep_conv4_1"
}
layer {
  name: "sep_scale4_1"
  type: "Scale"
  bottom: "sep_conv4_1"
  top: "sep_scale4_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu4_1"
  type: "ReLU"
  bottom: "sep_scale4_1"
  top: "sep_scale4_1"
}
layer {
  name: "dw_conv4_2"
  type: "Convolution"
  bottom: "sep_scale4_1"
  top: "dw_conv4_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn4_2"
  type: "BatchNorm"
  bottom: "dw_conv4_2"
  top: "dw_conv4_2"
}
layer {
  name: "dw_scale4_2"
  type: "Scale"
  bottom: "dw_conv4_2"
  top: "dw_scale4_2"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu4_2"
  type: "ReLU"
  bottom: "dw_scale4_2"
  top: "dw_scale4_2"
}
layer {
  name: "sep_conv4_2"
  type: "Convolution"
  bottom: "dw_scale4_2"
  top: "sep_conv4_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn4_2"
  type: "BatchNorm"
  bottom: "sep_conv4_2"
  top: "sep_conv4_2"
}
layer {
  name: "sep_scale4_2"
  type: "Scale"
  bottom: "sep_conv4_2"
  top: "sep_scale4_2"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu4_2"
  type: "ReLU"
  bottom: "sep_scale4_2"
  top: "sep_scale4_2"
}
layer {
  name: "dw_conv5_1"
  type: "Convolution"
  bottom: "sep_scale4_2"
  top: "dw_conv5_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn5_1"
  type: "BatchNorm"
  bottom: "dw_conv5_1"
  top: "dw_conv5_1"
}
layer {
  name: "dw_scale5_1"
  type: "Scale"
  bottom: "dw_conv5_1"
  top: "dw_scale5_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu5_1"
  type: "ReLU"
  bottom: "dw_scale5_1"
  top: "dw_scale5_1"
}
layer {
  name: "sep_conv5_1"
  type: "Convolution"
  bottom: "dw_scale5_1"
  top: "sep_conv5_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn5_1"
  type: "BatchNorm"
  bottom: "sep_conv5_1"
  top: "sep_conv5_1"
}
layer {
  name: "sep_scale5_1"
  type: "Scale"
  bottom: "sep_conv5_1"
  top: "sep_scale5_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu5_1"
  type: "ReLU"
  bottom: "sep_scale5_1"
  top: "sep_scale5_1"
}
layer {
  name: "dw_conv5_2"
  type: "Convolution"
  bottom: "sep_scale5_1"
  top: "dw_conv5_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn5_2"
  type: "BatchNorm"
  bottom: "dw_conv5_2"
  top: "dw_conv5_2"
}
layer {
  name: "dw_scale5_2"
  type: "Scale"
  bottom: "dw_conv5_2"
  top: "dw_scale5_2"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu5_2"
  type: "ReLU"
  bottom: "dw_scale5_2"
  top: "dw_scale5_2"
}
layer {
  name: "sep_conv5_2"
  type: "Convolution"
  bottom: "dw_scale5_2"
  top: "sep_conv5_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn5_2"
  type: "BatchNorm"
  bottom: "sep_conv5_2"
  top: "sep_conv5_2"
}
layer {
  name: "sep_scale5_2"
  type: "Scale"
  bottom: "sep_conv5_2"
  top: "sep_scale5_2"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu5_2"
  type: "ReLU"
  bottom: "sep_scale5_2"
  top: "sep_scale5_2"
}
layer {
  name: "dw_conv6_1"
  type: "Convolution"
  bottom: "sep_scale5_2"
  top: "dw_conv6_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1024
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "dw_bn6_1"
  type: "BatchNorm"
  bottom: "dw_conv6_1"
  top: "dw_conv6_1"
}
layer {
  name: "dw_scale6_1"
  type: "Scale"
  bottom: "dw_conv6_1"
  top: "dw_scale6_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "dw_relu6_1"
  type: "ReLU"
  bottom: "dw_scale6_1"
  top: "dw_scale6_1"
}
layer {
  name: "sep_conv6_1"
  type: "Convolution"
  bottom: "dw_scale6_1"
  top: "sep_conv6_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 2048
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "sep_bn6_1"
  type: "BatchNorm"
  bottom: "sep_conv6_1"
  top: "sep_conv6_1"
}
layer {
  name: "sep_scale6_1"
  type: "Scale"
  bottom: "sep_conv6_1"
  top: "sep_scale6_1"
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "sep_relu6_1"
  type: "ReLU"
  bottom: "sep_scale6_1"
  top: "sep_scale6_1"
}
layer {
  name: "pool"
  type: "Pooling"
  bottom: "sep_scale6_1"
  top: "pool"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "fc"
  type: "InnerProduct"
  bottom: "pool"
  top: "fc"
  inner_product_param {
    num_output: 101
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc"
  bottom: "label"
  top: "loss"
}
